Revit 2027 API
ColorFillScheme.CategoryId Property
 Represents the element category that can be colored by this scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId { get; }
Public ReadOnly Property CategoryId As ElementId
	Get
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
member CategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace